
lms> book add
=== Add New Book ===
Book ID: B104
Title: Ponniyin Selvan
Authors (comma-separated): kalki
ISBN (optional): 11111
Tags (comma-separated, optional): fantasy,drama
Total Copies: 4
Book 'Ponniyin Selvan' added successfully with ID: B104
lms> save
All data saved to CSV files successfully.
lms> book add
=== Add New Book ===
Book ID: B106
Title: The sublte art of not giving a ....
Authors (comma-separated): mark,phoebe
ISBN (optional): 89897879
Tags (comma-separated, optional): productivity,fun
Total Copies: 6
Book 'The sublte art of not giving a ....' added successfully with ID: B106
lms> save
All data saved to CSV files successfully.
lms> user add
=== Add New User ===
User ID: U110
Name: Madhan
Email (optional): madhan@gmail.com
User 'Madhan' added with ID: U110
lms> save
All data saved to CSV files successfully.
lms> borrow U110 B106
Borrow successful!
Transaction ID: T1
Due Date: 29-11-2025
lms> return T1
Book returned successfully.
lms> save
All data saved to CSV files successfully.
lms> loans overdur
lms> loans overdue
No overdue loans.
lms> book update
Usage: book add | update <id> | remove <id> | get <id> | list | search [title|author|tag] <value>
lms> book update B110
Error: Book not found
lms> book update B106
=== Updating Book: The sublte art of not giving a .... ===
Leave blank to keep current value.
Title [The sublte art of not giving a ....]:
Authors [mark, phoebe]: Raj,Deva
ISBN [89897879]: 111111
Tags [productivity, fun]: 
Total Copies [6]: 10
Book updated successfully.
lms> save
All data saved to CSV files successfully.
lms> user ban U100
Error: User not found
lms> user list

=== All Users (1) ===
U110: Madhan [ACTIVE] (Loans: 0/5)
lms> user ban U110
User U110 is now BANNED.
lms> book remove B110
Error: Book not found
lms> book remove B106
Remove book 'The sublte art of not giving a ....' (ID: B106)? [y/N]: y
Book removed.
lms> report summary

=== Library Summary ===
Total Books: 1
Total Users: 1
Active Loans: 0
Overdue Loans: 0